export const testData = [
  {
    id: 0,
    text: 'Потоком называется…',
    answers: [
      'последовательная смена состояний вычислений во времени',
      'последовательная смена явлений, состояний в развитии вычислений',
      'абстракция, используемая для чтения или записи файлов, сокетов и т. п. в единой манере',
    ],
    correct: 3,
  },
  {
    id: 1,
    text: 'Процессом называется…',
    answers: [
      'последовательная смена явлений, состояний в развитии вычислений',
      'последовательная смена состояний вычислений во времени',
      'абстрактное понятие, относящееся к программе',
    ],
    correct: 3,
  },
  {
    id: 2,
    text: 'Конкурентность – это…',
    answers: [
      'разделение выполнения на параллельные потоки выполнения задач',
      'разделение выполнения задачи на подзадачи с интервалами перекрытия во времени',
      'разделение выполнения программы на интервалы выполнения задач строго одинаковой длины',
    ],
    correct: 2,
  },
  {
    id: 3,
    text: 'Задачи в JavaScript выполняются…',
    answers: [
      'Конкурентно',
      'Симметрично',
      'Параллельно',
    ],
    correct: 1,
  },
  {
    id: 4,
    text: 'Веб-исполнитель предназначен для…',
    answers: [
      'Работы с файловой системой',
      'Запуска новой среды выполнения JavaScript в отдельном потоке',
      'Реализации многопоточности в однопоточном языке JavaScript',
    ],
    correct: 2,
  },
  {
    id: 5,
    text: 'Выделенный исполнитель…',
    answers: [
      'Может быть доступен из разных сред браузера: вкладок, iframe, веб-исполнителя',
      'Способен работать в фоновом режиме',
      'Доступен в рамках одной страницы',
    ],
    correct: 3,
  },
]